---
title: DirectShapeOptions
classe: Autodesk.Revit.DB.DirectShapeOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# DirectShapeOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `directShapeOptions.IsValidObject` | Boolean |
| `DirectShapeReferencingOption ReferencingOption { get; set; }` | `directShapeOptions.ReferencingOption` | DirectShapeReferencingOption |
| `DirectShapeRoomBoundingOption RoomBoundingOption { get; }` | `directShapeOptions.RoomBoundingOption` | DirectShapeRoomBoundingOption |
| `Void Dispose()` | `directShapeOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```